/* ========================================
	CatRobotGame/
	------------------------------------
	シーン(ステージ4)用ヘッダ
	------------------------------------
	説明：ステージ4のシーンクラス
	------------------------------------
	SceneStage4.h
========================================== */
#pragma once

// =============== インクルード ===================
#include "SceneBase.h"

// =============== クラス定義 ===================
class SceneStage4 :
    public SceneBase
{
public:
	void InitLocal() override;
	DEFINE_SCENE_TYPE(SceneStage4)
};

